//上边部分
let a = "";//定义一个空字符串作为“*”之间的间隔
        for (let k = 1; k <= 4; k++) {//外层循环控制行数,先输出上半部分的4行

            for (let j = 1; j <= 4 - k; j++) {    
                a = a + " "                      
            } 
            for (let i = 1; i <= k; i++) {//星星数
                a = a + "* ";
            }
            a = a + "\n";//外层循环，每输出一行要换行
        }
        //下边部分
        for (let k = 1; k <= 3; k++) {//外层循环控制行数,输出下半部分的3行

            for (let j = 1; j <= k; j++) {         
                a = a + " " 
            } 
            for (let i = 1; i <= 4 - k; i++) {//星星数 
                a = a + "* ";                       
            }
            a = a + "\n";//外层循环，每输出一行要换行
        }
        console.log(a);
